<?php

// 测试数组键名
$arr = array(
  '3' => 'a',       // 3
  2.4 => 'b',       // 2
  '2.4' => 'c',     // "2.4"
  true => 'd',      // 1
  false => 'e',     // 0
  '' => 'f',        // ""
  null => 'g'       // ""
);

// 如果下标重复, 后面的value 覆盖前面的value;
$arr = array('a', 0 => 'b');
$arr = array(
  'r',
  'a', 'b', 'c',
  5 => 'e',
  'q' => 'f',

  //如果没有负数下标 没有确定下标的 key 已有的最大下标 +1;
  'g'
);
$arr = array(
  // 如果已有下标都为负数, 那么从0开始
  -12 => 'a',
  'b'
);
$arr = ['a', 'b', 'c'];
$arr = [1 => 'a'];
var_dump($arr);

echo "<pre/>";

// 多唯数组














//
